# The <code>fillna()</code> Method
By: <a href='https://www.youtube.com/wonkyCode'>WonkyCode</a>

In [1]:
import numpy as np
import pandas as pd

dataset = {
    "name" : ["Rohit", "Harsha", "Saran", "Abhijith", np.nan],
    "age" : [25, 18, np.nan, np.nan, np.nan],
    "height": [5.6, 5.8, 6.2, np.nan, np.nan],
    "job": [True, np.nan, np.nan, np.nan, np.nan]
}
data = pd.DataFrame(dataset)

In [2]:
data

       name   age  height   job
0     Rohit  25.0     5.6  True
1    Harsha  18.0     5.8   NaN
2     Saran   NaN     6.2   NaN
3  Abhijith   NaN     NaN   NaN
4       NaN   NaN     NaN   NaN

In [3]:
data.fillna("None")

       name   age height   job
0     Rohit    25    5.6  True
1    Harsha    18    5.8  None
2     Saran  None    6.2  None
3  Abhijith  None   None  None
4      None  None   None  None

In [4]:
data

       name   age  height   job
0     Rohit  25.0     5.6  True
1    Harsha  18.0     5.8   NaN
2     Saran   NaN     6.2   NaN
3  Abhijith   NaN     NaN   NaN
4       NaN   NaN     NaN   NaN

In [5]:
data["age"].fillna(data["age"].mean())

0    25.0
1    18.0
2    21.5
3    21.5
4    21.5
Name: age, dtype: float64

In [6]:
data["age"].fillna(data["age"].mean(), inplace= True)

In [7]:
data

       name   age  height   job
0     Rohit  25.0     5.6  True
1    Harsha  18.0     5.8   NaN
2     Saran  21.5     6.2   NaN
3  Abhijith  21.5     NaN   NaN
4       NaN  21.5     NaN   NaN

In [8]:
data["job"].fillna("No Job", inplace= True)

In [9]:
data

       name   age  height     job
0     Rohit  25.0     5.6    True
1    Harsha  18.0     5.8  No Job
2     Saran  21.5     6.2  No Job
3  Abhijith  21.5     NaN  No Job
4       NaN  21.5     NaN  No Job

**Useful References:**
* https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.fillna.html#pandas.DataFrame.fillna